results/daphne-1000-requests-200-concurrency.txt
Summary:
  Total:        7.1414 secs
  Slowest:      1.8144 secs
  Fastest:      1.0059 secs
  Average:      1.4148 secs
  Requests/sec: 140.0292

  Total data:   13770 bytes
  Size/request: 18 bytes

Response time histogram:
  1.006 [1]     |
  1.087 [100]   |■■■■■■■■■■■■■■■■■■■■■■■■■■■
  1.168 [62]    |■■■■■■■■■■■■■■■■■
  1.248 [41]    |■■■■■■■■■■■
  1.329 [81]    |■■■■■■■■■■■■■■■■■■■■■■
  1.410 [105]   |■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  1.491 [57]    |■■■■■■■■■■■■■■■■
  1.572 [39]    |■■■■■■■■■■■
  1.653 [147]   |■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  1.734 [54]    |■■■■■■■■■■■■■■■
  1.814 [78]    |■■■■■■■■■■■■■■■■■■■■■


Latency distribution:
  10% in 1.0431 secs
  25% in 1.2395 secs
  50% in 1.4050 secs
  75% in 1.6176 secs
  90% in 1.7408 secs
  95% in 1.8123 secs
  99% in 1.8142 secs

Details (average, fastest, slowest):
  DNS+dialup:   0.0113 secs, 1.0059 secs, 1.8144 secs
  DNS-lookup:   0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:    0.0001 secs, 0.0000 secs, 0.0051 secs
  resp wait:    1.4032 secs, 1.0058 secs, 1.7228 secs
  resp read:    0.0000 secs, 0.0000 secs, 0.0001 secs

Status code distribution:
  [200] 765 responses

Error distribution:
  [24]  Get "http://127.0.0.1:8000/": dial tcp 127.0.0.1:8000: connect: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58132->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58134->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58135->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58136->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58137->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58138->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58139->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58140->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58141->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58142->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58143->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58144->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58145->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58146->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58147->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58148->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58149->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58150->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58151->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58152->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58153->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58154->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58155->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58156->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58157->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58158->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58159->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58160->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58161->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58162->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58163->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58164->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58165->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58166->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58167->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58168->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58169->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58170->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58171->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58172->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58173->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58174->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58175->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58177->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58178->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58179->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58180->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58181->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58182->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58183->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58184->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58185->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58186->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58187->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58188->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58189->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58190->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58191->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58192->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58193->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58194->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58196->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58197->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58199->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58200->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58201->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58202->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58203->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58204->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58205->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58207->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58208->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58209->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58210->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58211->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58212->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58213->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58214->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58215->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58216->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58217->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58218->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58219->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58221->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58223->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58224->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58226->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58227->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58228->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58229->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58230->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58231->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58232->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58234->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58236->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58240->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58243->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58245->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58248->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58250->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58270->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58277->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58280->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58283->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58284->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58286->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58288->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58289->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58290->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58291->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58292->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58293->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58294->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58295->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58296->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58297->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58298->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58299->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58300->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58301->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58302->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58303->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58304->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58305->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58306->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58307->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58308->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58309->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58310->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58311->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58312->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58313->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58315->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58316->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58318->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58320->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58321->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58323->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58324->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58325->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58327->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58328->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58329->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58330->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58332->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58333->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58334->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58335->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58337->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58338->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58339->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58340->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58341->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58342->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58344->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58345->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58346->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58347->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58348->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58350->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58351->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58352->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58353->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58354->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58356->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58357->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58358->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58359->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58361->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58363->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58365->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58366->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58368->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58369->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58370->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58371->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58372->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58373->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58375->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58376->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58378->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58380->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58381->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58382->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58383->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58384->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58386->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58387->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58388->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58389->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58390->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58391->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58393->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58394->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58395->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58397->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58398->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58399->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58400->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58401->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58403->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58405->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58406->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58407->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58409->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58410->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58412->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58413->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58414->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58436->127.0.0.1:8000: read: connection reset by peer
  [1]   Get "http://127.0.0.1:8000/": read tcp 127.0.0.1:58495->127.0.0.1:8000: read: connection reset by peer